{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "text": "David Marx",
    "file": "",
    "link": ""
  },
  "text": {
    "title": "Map of Reddit",
    "more": "A user is active in a subreddit if they commented in at least 3 separate posts in a given month.\n\nAn edge between two subreddits denotes that during at least one month between January 2015 and November 2016, the linked subreddits had at least 10 active users, at least 2 users in common, and at least 10% active users in common with respect to the smaller of the subreddits (with the arrow pointing towards the subreddit with fewer active users during that period), the \"mutual user ratio.\"\n\nEdges are weighted according to the highest observed mutual user ratio between those two subreddits across all months.\n\nA subreddit only appears in the map if it satisfies the following additional conditions: (1) it had an average of at least 1 active user from September-Novemebr 2016, and (2) it has at least one edge connected to it. Subreddits that were not recently active or were a relationship could not be inferred are excluded. Notable examples of ignored but active subreddits include /r/MapleStory, /r/MSLGame and /r/indonesia.\n\nColor denotes membership to a \"community\" of subreddits determined algorithmically (gephi\u0027s modularity minimzation algorithm).\n\nLayout was calculated using gephi\u0027s Force Atlas 2 algorithm, with LinLog mode and Prevent Overlap options.\n\nEdges were inferred from the public comments dataset collected by /u/stuck_in_the_matrix and made available on Google Bigquery by Felipe Hoffa (/u/fhoffa).",
    "intro": "Map of Reddit: Community Structure\n\nOnly subreddits that were active in September-November 2016 are shown. Relationships between subreddits inferred from 2015-2016 public comments.Click below for more details."
  },
  "legend": {
    "edgeLabel": "\u003e\u003d 10% users in common",
    "colorLabel": "Community",
    "nodeLabel": "Subreddit"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "Modularity Class",
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "imageAttribute": false,
    "groupByEdgeDirection": false
  },
  "sigma": {
    "graphProperties": {
      "minEdgeSize": 0.2,
      "maxNodeSize": 7,
      "maxEdgeSize": 0.5,
      "minNodeSize": 1
    },
    "drawingProperties": {
      "labelThreshold": 10,
      "hoverFontStyle": "bold",
      "defaultEdgeType": "curve",
      "defaultLabelColor": "#000",
      "defaultLabelHoverColor": "#fff",
      "defaultLabelSize": 14,
      "activeFontStyle": "bold",
      "fontStyle": "bold",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd"
    },
    "mouseProperties": {
      "minRatio": 0.75,
      "maxRatio": 20
    }
  }
}